pokemon-teams-backend/app/controllers/pokemons_controller.rb

  def index
    render :json => Pokemon.all
---
SELECT "pokemons".* FROM "pokemons"

  def update
    # params => { id: 4, pokemon: { id: 4, species: "...", nickname: "...", trainer_id: 1}}

    pokemon = Pokemon.find(params[:id])
    pokemon.update(pokemon_params)
---
SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "pokemons" SET "nickname" = ?, "updated_at" = ? WHERE "pokemons"."id" = ?  [["nickname", "Shannon!"], ["updated_at", "2019-10-17 18:47:37.429956"], ["id", 2]]